cask_args appdir: "/Applications"

tap "golangci/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "alecthomas/homebrew-tap"
tap "aws/tap"
tap "mongodb/brew"

# Tools
brew 'awscli'
brew 'awsebcli'
brew 'aws-sam-cli'
brew 'aws-rotate-key'
brew 'adr-tools'
brew 'cfn-lint'
brew 'circleci'
brew 'cocoapods'
brew 'exercism'
brew 'fastlane'
brew 'gh'
brew 'git'
brew 'htop'
brew 'jq'
brew 'kops'
brew 'libxml2'
brew 'mongodb-community'
brew 'n'
brew 'node'
brew 'openvpn'
brew 'pre-commit'
brew 'scrcpy'

# Images
brew 'cairo'
brew 'giflib'
brew 'jpeg'
brew 'libpng'
brew 'librsvg'
brew 'pango'
brew 'pkg-config'

# TV and mobile
brew 'libffi'
cask 'android-studio'
cask 'android-platform-tools'

# Virtual Machines, used for windows VMs
cask 'utm'

## Terraform
brew 'terraform'
brew 'terraform-docs'
brew 'tflint'

brew 'thefuck'
brew 'vegeta'
brew 'watch'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'

# Go Tools
brew "go"
brew "gometalinter"
brew "golangci-lint"

# Applications
cask 'aws-vault'
cask 'brave-browser'
cask "cyberduck"
cask "docker"
cask "firefox"
cask "fliqlo"
cask "flux"
cask "gitify"
cask "google-chrome"
cask 'iterm2'
cask 'mobster'
cask 'mongodb-compass'
cask 'ngrok'
cask 'nordvpn'
cask 'postman'
cask 'responsively'
cask 'sequel-pro'
cask 'sketch'
cask 'slack-beta'
cask 'spectacle'
cask 'spotify'
cask 'vagrant'
cask 'vagrant-manager'
cask "visual-studio-code"
cask 'vlc'
cask 'zoom'
