cask_args appdir: "/Applications"

tap "fullscreen/tap"
tap "golangci/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "alecthomas/homebrew-tap"
tap "aws/tap"

# Tools
brew 'awscli'
brew 'awsebcli'
brew 'aws-sam-cli'
brew 'aws-rotate-key'
brew 'adr-tools'
cask 'adoptopenjdk8'
brew 'cfn-lint'
brew 'circleci'
brew 'cocoapods'
brew 'elasticsearch'
brew 'exercism'
brew 'github/gh/gh'
brew 'htop'
brew 'jq'
brew 'kops'
brew 'libxml2'
brew 'n'
brew 'node'
brew 'openvpn'
brew 'pre-commit'
brew 'shellcheck'
brew 'terraform'
brew 'thefuck'
brew 'vegeta'
brew 'watch'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'

# Go Tools
brew "go"
brew "gometalinter"
brew "golangci-lint"

# Applications
cask 'android-studio'
cask 'android-platform-tools'
cask 'aws-vault'
cask "cyberduck"
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask 'iterm2'
cask 'java'
cask 'mobster'
cask 'ngrok'
cask 'nordvpn'
cask 'postman'
cask 'sequel-pro'
cask 'slack-beta'
cask 'spectacle'
cask 'spotify'
cask 'vagrant'
cask 'vagrant-manager'
cask "visual-studio-code"
cask 'virtualbox' # This seems to always fail TODO
cask 'vlc'
cask 'zoomus'
