cask_args appdir: "/Applications"

tap "fullscreen/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "alecthomas/homebrew-tap"
tap "aws/tap"

# Tools
brew 'awscli'
brew 'awsebcli'
brew 'aws-rotate-key'
cask 'adoptopenjdk8'
brew 'cfn-lint'
brew 'circleci'
brew 'elasticsearch'
brew 'exercism'
brew 'htop'
brew 'kops'
brew 'n'
brew 'node'
brew 'openvpn'
brew 'aws-sam-cli'
brew 'shellcheck'
brew 'terraform'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'

# Go Tools
brew "go"
brew "gometalinter"

# Applications
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask 'iterm2'
cask 'ngrok'
cask 'nordvpn'
cask 'postman'
cask 'slack-beta'
cask 'spectacle'
cask 'spotify'
cask "visual-studio-code"
# cask 'virtualbox' # This seems to always fail TODO
cask 'vlc'
cask 'zoomus'
